#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```module.ec2_instance.data.aws_partition.current: Reading...
data.aws_ami.aws_ami_data: Reading...
module.ec2_instance.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_ami.aws_ami_data: Read complete after 1s [id=ami-012967cc5a8c9f891]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_security_group.azmi1-tf-sg-allow-ssh-http-https will be created
  + resource "aws_security_group" "azmi1-tf-sg-allow-ssh-http-https" {
      + arn                    = (known after apply)
      + description            = "Allow ssh, http and https traffic to the vpc"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allows unrestricted outbound traffic from the associated resource to any destination on the internet, using any protocol and port."
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allows incoming HTTP traffic (TCP port 80) from any IPv4 address on the internet."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allows incoming HTTPS traffic (TCP port 443) from any IPv4 address on the internet."
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allows incoming SSH traffic (TCP port 22) from any IPv4 address on the internet."
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "azmi1-sg-allow-ssh-http-https-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "azmi1-vpc-dev-default"
        }
      + tags_all               = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-vpc-dev-default"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "azmi1-vpc-dev-default"
        }
      + tags_all               = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-vpc-dev-default"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "azmi1-vpc-dev-default"
        }
      + tags_all               = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-vpc-dev-default"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "azmi1-igw-dev"
        }
      + tags_all = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-igw-dev"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "azmi1-vpc-dev-private-us-east-1a"
        }
      + tags_all         = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-vpc-dev-private-us-east-1a"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "azmi1-vpc-dev-private-us-east-1b"
        }
      + tags_all         = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-vpc-dev-private-us-east-1b"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "azmi1-vpc-dev-public"
        }
      + tags_all         = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-vpc-dev-public"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "azmi1-private-subnet-az1-dev"
        }
      + tags_all                                       = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-private-subnet-az1-dev"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "azmi1-private-subnet-az2-dev"
        }
      + tags_all                                       = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-private-subnet-az2-dev"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "azmi1-public-subnet-az1-dev"
        }
      + tags_all                                       = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-public-subnet-az1-dev"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "azmi1-public-subnet-az2-dev"
        }
      + tags_all                                       = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-public-subnet-az2-dev"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "azmi1-vpc-dev"
        }
      + tags_all                             = {
          + "Cohort"             = "CE7"
          + "Environment"        = "dev"
          + "Name"               = "azmi1-vpc-dev"
          + "Owner"              = "Azmi"
          + "Terraform"          = "true"
          + "TerraformWorkspace" = "dev"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_arn = (known after apply)
  + vpc_id  = (known after apply)
```

</details>

*Pushed by: @RaytraceSG, Action: `pull_request`, Workflow: `Terraform Plan`*